Revit 2027 API
DockablePaneState.TabBehind Property
 Ignored unless %dockPosition% is Tabbed. The new pane will appear in a tab behind the specified existing pane ID.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockablePaneId TabBehind { get; set; }
Public Property TabBehind As DockablePaneId
	Get
	Set
public:
property DockablePaneId^ TabBehind {
	DockablePaneId^ get ();
	void set (DockablePaneId^ value);
}
member TabBehind : DockablePaneId with get, set
Property Value
DockablePaneId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: no dockable pane has been registered with identifier tabBehind.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DockablePaneState Class
Autodesk.Revit.UI Namespace